app/Controllers/Funcionarios.php

SELECT *
FROM `funcionarios`
---
   public function index()
   {
        $funcionarios = $this->funcionario_model
                             ->findAll();