app/Controllers/Login.php

SELECT *
FROM `logins`
WHERE `usuario` = 'admin'
AND `senha` = '200820e3227815ed1756a6b531e7e0d2'
 LIMIT 1
---
    public function autenticar()
    {
        $dados = $this->request->getVAR();

        //dd($dados); // foi usado para testar se os dados de login estão mesmo sendo enviado.

        $usuario = $this->login_model
                        ->where('usuario', $dados['usuario'])
                        ->where('senha', md5($dados['senha']))
                        ->first();