app/Controllers/Produtos.php

   public function index()
   {
        $produtos = $this->produto_model
                            ->findAll();
---
SELECT *
FROM `produtos`

    public function excluir()
    {
        $id_produto = $this->request->getVar('id_produto'); // Obtendo o valor de id_produto

        //dd($id_produto); // Exibindo o valor de id_produto

        $this->produto_model
            ->where('id_produto', $id_produto)
            ->delete();
---
DELETE FROM `produtos`
WHERE `id_produto` = '18'